# RbsParallelpipesHorizontalOffsetValue Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RbsParallelpipesHorizontalOffsetValue Property
ParameterTypeId Class See Also
---
"Horizontal Offset value for parallel pipes"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RbsParallelpipesHorizontalOffsetValue { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RbsParallelpipesHorizontalOffsetValue As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RbsParallelpipesHorizontalOffsetValue {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace